OpsAdmin_Java/Ops-ejb/src/conf/wsdl/ec2-50-19-193-4.compute-1.amazonaws.com_8080/OpaSOAP/OpaSOAP.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.1 (branches/2.1-6728; 2011-02-03T14:14:58+0000) JAXWS-RI/2.2.3 JAXWS/2.2. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.1 (branches/2.1-6728; 2011-02-03T14:14:58+0000) JAXWS-RI/2.2.3 JAXWS/2.2. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://soap.caratti.eti.br/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://soap.caratti.eti.br/" name="OpaSOAP">
<types>
<xsd:schema>
<xsd:import namespace="http://soap.caratti.eti.br/" schemaLocation="http://ec2-50-19-193-4.compute-1.amazonaws.com:8080/OpaSOAP/OpaSOAP?xsd=1" />
</xsd:schema>
</types>
<message name="sendOpa">
<part name="parameters" element="tns:sendOpa" />
</message>
<message name="sendOpaResponse">
<part name="parameters" element="tns:sendOpaResponse" />
</message>
<portType name="OpaSOAP">
<operation name="sendOpa">
<input wsam:Action="http://soap.caratti.eti.br/OpaSOAP/sendOpaRequest" message="tns:sendOpa" />
<output wsam:Action="http://soap.caratti.eti.br/OpaSOAP/sendOpaResponse" message="tns:sendOpaResponse" />
</operation>
</portType>
<binding name="OpaSOAPPortBinding" type="tns:OpaSOAP">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
<operation name="sendOpa">
<soap:operation soapAction="" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
</binding>
<service name="OpaSOAP">
<port name="OpaSOAPPort" binding="tns:OpaSOAPPortBinding">
<soap:address location="http://ec2-50-19-193-4.compute-1.amazonaws.com:8080/OpaSOAP/OpaSOAP" />
</port>
</service>
</definitions>